# Есть список кард:
#   current_hand = [2, 3, 4, 10, 'Q', 5]
# Список может содержать следующие значения:
#   2, 3, 4, 5, 6, 7, 8, 9, 10, 'J', 'Q', 'K', 'A'.
# У карты есть свой "вес":
#   2, 3, 4, 5, 6 = 1
#   7, 8, 9 = 0
#   10, 'J', 'Q', 'K', 'A', = -1
# посчитать вес руки

def main():
    current_hand = [2, 3, 4, 10, 'Q', 5]
    cards_sum: int = 0

    weight: dict = {
        2: 1, 3: 1, 4: 1, 5: 1, 6: 1,
        7: 0, 8: 0, 9: 0,
        10: -1, 'J': -1, 'Q': -1, 'K': -1, 'A': -1
    }

    for card in current_hand:
        cards_sum = cards_sum + weight[card]


if __name__ == "__main__":
    main()
