# Семи-карточный техасский покер. На столе лежат пять карт и в руке две карты.
# Необходимо определить есть ли комбинация, называемая флеш (Flush).
# Комбинация флеш определяется наличием пяти карт одной масти (среди всех карт: и тех, что лежат на столе
# и тех что в руке)
#
# Стол = ["A_S", "J_H", "7_D", "8_D", "10_D"], Рука = ["J_D", "3_D"]
#
# "Номинал_Масть"

def main():
    hand: [str] = ["A_S", "J_H", "7_D", "8_D", "10_D"]
    table: [str] = ["J_D", "3_D"]


if __name__ == "__main__":
    main()

